Revit 2026 API

# ScheduleField Methods

---

The ScheduleField type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanDisplayMinMax | Indicates if this field can display minimum and maximum values. |
|  | CanTotal | Indicates if totals can be enabled for this field. |
|  | CanTotalByAssemblyType | Indicates if totals by assembly type can be enabled for this field. |
|  | CreatesCircularReferences | Checks whether a field ID would create a circular chain of references when used by the PercentageOf property of this field. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCombinedParameters | Gets this field's combine parameter array if applicable |
|  | GetCustomFieldData | Gets the data associated with this custom field. If this field isn't a CustomField will return . |
|  | GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetName | Gets the name of the field. |
|  | GetSchedulableField | Gets a SchedulableField object representing this field. |
|  | GetSpecTypeId | The spec describing values of this field, if applicable. |
|  | GetStyle | Gets the style of this field. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidCombinedParameters |  |
|  | ResetOverride | Resets the override of this field. |
|  | SetCombinedParameters |  |
|  | SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |
|  | SetStyle | Sets the style of this field. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace